// export enum HttpCode{
//     400=400,
//     401=401,
//     403=403,
//     404=404,
//     408=408,
//     500=500,
//     501=501,
//     502=502,
//     503=503,
//     504=504,
//     505=505,
// }

// export type HttpCode = 401

export const HTTP_ERROR = {
    400:"请求错误(400)",
    401:"未授权，请重新登录(401)",
    403:"拒绝访问(403)",
    404:"找不到URL(404)",
    408:"请求超时(408)",
    500:"服务器错误(500)",
    501:"服务未实现(501)",
    502:"网络错误(502)",
    503:"服务不可用(503)",
    504:"网络超时(504)",
    505:"HTTP版本不受支持(505)",
}
